{
    "Paragraph_1": "DANIEL SEAN AUGUSTAMay 8, 1989 - May 26, 2023On May 26, 2023, Daniel Sean Augusta of Winnipeg passed peacefully at home with his family at his side. He will be deeply missed by parents, Kevin and Brenda Augusta, brother Scott, aunt Shelley Augusta, uncle Dean (Elaine) Byers, cousins, Erin, Ryan, Mandy, and Ty, an extended family across the country, and many friends. Dan was memorable - you couldn’t meet him and not remember him.Dan had a great sense of humour. He saw the world through glasses just slightly askew and all who knew him experienced his comedic timing, storytelling skill, and love of the pun. Along with co-conspirators Jessy Ardern and Ariel Levine, whom he met through The Shakespeare Company at Manitoba Theatre for Young People, he co-founded The Struts and Frets Players. Their mission was to breathe new life into old stories and share them with a wider audience. This collaboration resulted in six Winnipeg Fringe Theatre shows, lots of laughs, the occasional tear, great reviews, and deep and lasting friendships. Dan did a degree in Theatre and Film at the University of Winnipeg following his graduation from Miles Macdonell Collegiate in 2007. His theatre work included roles in Revenge of the Meek, Ripple Effect, The God Box, The Winter’s Tale, and The Ghost Sonata. He also appeared on film in The Capture of the Green River Killer and New in Town featuring Renée Zellweger and Harry Connick Jr.In 2017 Dan joined Sick & Twisted, a theatre company dedicated to “exploring the experience of living with a disability.” His one-man show in their first disability cabaret, Lame Is, was a personal and courageous exploration of the company’s belief that “truth in performance is not dependent on bodily perfection.” The power of art to change and broaden perspectives was important to Dan and after performing in two disability cabarets, he joined the board of the company.Dan was a foodie and a great home chef. After a childhood that included long periods of nourishment by intravenous only and years of tube feeding, he became passionate about cooking, applying his curious mind to the art and science of food preparation. In 2023 he created a book of recipes dedicated to encouraging home cooks, self-described foodies, curious minds, and kitchen putterers to keep learning and to not let the perfect be the enemy of the good. While others baked bread through the pandemic, Dan grew mushrooms and made kombucha. Our family meals will be less flavourful without Dan’s urging to “just add a little more.”Dan wanted to be remembered for who he was - a caring and vital human being, a good friend, a loving son and brother, and someone intellectually engaged with the world. Dan was a frequent flyer in the health care system. He and his family were and are extremely grateful for the excellent care and treatment he received in Winnipeg, Toronto, and the United States. Daniel, and therefore our family, was the recipient of more than one miracle. For this we thank every nurse, doctor, Child Life Specialist, medical student, physiotherapist, occupational therapist, respiratory therapist we met over the past 34 years. From you we learned how to help our son and brother live his life.Dan was interred in a private graveside service on May 31, 2023. A Celebration of  Life will follow in the months ahead…we need time to celebrate Dan’s life in the way he deserves.In lieu of flowers please consider a donation to: Manitoba Theatre for Young People, 2 Forks Market Road, Winnipeg, MB R3C 4X1, or Young Adult Cancer Canada, PO Box 29055 Torbay Road, St. John’s, NL A1A 5B5.Richard RosinFuneral Director Ltd.204-219-1126richardrosin.ca",
    "Paragraph_2": "On May 26, 2023, Daniel Sean Augusta of Winnipeg passed peacefully at home with his family at his side. He will be deeply missed by parents, Kevin and Brenda Augusta, brother Scott, aunt Shelley Augusta, uncle Dean (Elaine) Byers, cousins, Erin, Ryan, Mandy, and Ty, an extended family across the country, and many friends. Dan was memorable - you couldn’t meet him and not remember him.Dan had a great sense of humour. He saw the world through glasses just slightly askew and all who knew him experienced his comedic timing, storytelling skill, and love of the pun. Along with co-conspirators Jessy Ardern and Ariel Levine, whom he met through The Shakespeare Company at Manitoba Theatre for Young People, he co-founded The Struts and Frets Players. Their mission was to breathe new life into old stories and share them with a wider audience. This collaboration resulted in six Winnipeg Fringe Theatre shows, lots of laughs, the occasional tear, great reviews, and deep and lasting friendships. Dan did a degree in Theatre and Film at the University of Winnipeg following his graduation from Miles Macdonell Collegiate in 2007. His theatre work included roles in Revenge of the Meek, Ripple Effect, The God Box, The Winter’s Tale, and The Ghost Sonata. He also appeared on film in The Capture of the Green River Killer and New in Town featuring Renée Zellweger and Harry Connick Jr.In 2017 Dan joined Sick & Twisted, a theatre company dedicated to “exploring the experience of living with a disability.” His one-man show in their first disability cabaret, Lame Is, was a personal and courageous exploration of the company’s belief that “truth in performance is not dependent on bodily perfection.” The power of art to change and broaden perspectives was important to Dan and after performing in two disability cabarets, he joined the board of the company.Dan was a foodie and a great home chef. After a childhood that included long periods of nourishment by intravenous only and years of tube feeding, he became passionate about cooking, applying his curious mind to the art and science of food preparation. In 2023 he created a book of recipes dedicated to encouraging home cooks, self-described foodies, curious minds, and kitchen putterers to keep learning and to not let the perfect be the enemy of the good. While others baked bread through the pandemic, Dan grew mushrooms and made kombucha. Our family meals will be less flavourful without Dan’s urging to “just add a little more.”Dan wanted to be remembered for who he was - a caring and vital human being, a good friend, a loving son and brother, and someone intellectually engaged with the world. Dan was a frequent flyer in the health care system. He and his family were and are extremely grateful for the excellent care and treatment he received in Winnipeg, Toronto, and the United States. Daniel, and therefore our family, was the recipient of more than one miracle. For this we thank every nurse, doctor, Child Life Specialist, medical student, physiotherapist, occupational therapist, respiratory therapist we met over the past 34 years. From you we learned how to help our son and brother live his life.Dan was interred in a private graveside service on May 31, 2023. A Celebration of  Life will follow in the months ahead…we need time to celebrate Dan’s life in the way he deserves.In lieu of flowers please consider a donation to: Manitoba Theatre for Young People, 2 Forks Market Road, Winnipeg, MB R3C 4X1, or Young Adult Cancer Canada, PO Box 29055 Torbay Road, St. John’s, NL A1A 5B5.",
    "Paragraph_3": "Man, I am so so sad to hear about Dan's passing. The friendship I had with him while we were studying theatre at University of Winnipeg is still one of the bright spots of my time there. We were in the Ghost Sonata together, and got to spend a lot of hours with each other in rehearsals and cast outings. Dan was so funny, bright, a great listener, conversationalist and friend. He had a way with dialogue and really brought life to the words in the script. As an artist he inspired me. Nothing seemed to keep him down or down for too long. He always had a grateful and generous spirit. I'm blessed to have known him.- Posted by: Melissa Hiebert (University comrade) on: Dec 31, 2024",
    "Paragraph_4": "I am truly sorry for your loss and apologize for not knowing sooner. Daniel was fortunate to have such a loving family surrounding him with support and care. I will always remember his witty comments and his concern for a hamster. Take time to mourn and we will connect later. I will be thinking of you, Brenda, your loss must be immeasurable.- Posted by: Terry Phillips (Friend of his mother) on: Oct 22, 2023",
    "Paragraph_5": "I was so sad to hear of Dan's passing. I send you my deepest condolences. It is so heart breaking to lose a child. May he rest in peace. Take care. Barb Strachan- Posted by: Barbara Strachan (Friend of mother) on: Jun 10, 2023",
    "Paragraph_6": "Dear Brenda and family. So sorry to hear of Daniel’s passing.  Please accept my deepest sympathies.  May he Rest in Peace.- Posted by: Tracey Caldwell (former colleague) on: Jun 03, 2023",
    "Paragraph_7": "I went to highschool with Dan. As I’ve lived in Ottawa ever since, we have only chatted here or there over the years. I happen to be home for a visit and saw Dan’s obituary this morning in the paper; I was surprised with how overcome with emotion I became. I just wanted to send my warm thoughts to his family and community, and say it’s clearly so true that he was memorable, as this beautiful obituary says. Dan was kind, creative, funny and highly intelligent. I’m so sad to learn of this loss but glad to know he was loved so well. Wishing you peace at this difficult time.- Posted by: Glennys Egan (Classmate) on: Jun 03, 2023",
    "Paragraph_8": "Dan had so many qualities, but 2 come to my mind. Do not bring up a subject unless you have all the facts because he has the facts and he will question you. The other is board games, he would see the look of fear in my eyes as soon as he said this is an easy one, I don’t think he knew what easy meant to me, so needless to say I never did understand the games he chose.\r\nI will miss his quick come backs on something someone said and then giving his interpretation.- Posted by: Gail Simons (Grand nephew ) on: Jun 03, 2023"
}